TUK-Locker/stm32f429zi/TUK_Car_2017132035/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Wheel_Right_DIR_Pin GPIO_PIN_0
#define Wheel_Right_DIR_GPIO_Port GPIOC
#define Wheel_Left_DIR_Pin GPIO_PIN_3
#define Wheel_Left_DIR_GPIO_Port GPIOC
#define Wheel_PWM_Pin GPIO_PIN_0
#define Wheel_PWM_GPIO_Port GPIOA
#define ESP8266_USART_TX_Pin GPIO_PIN_2
#define ESP8266_USART_TX_GPIO_Port GPIOA
#define ESP8266_USART_RX_Pin GPIO_PIN_3
#define ESP8266_USART_RX_GPIO_Port GPIOA
#define RELAY_Pin GPIO_PIN_4
#define RELAY_GPIO_Port GPIOA
#define LM_PWM_Pin GPIO_PIN_6
#define LM_PWM_GPIO_Port GPIOA
#define BOOT1_Pin GPIO_PIN_2
#define BOOT1_GPIO_Port GPIOB
#define limit_Pin GPIO_PIN_11
#define limit_GPIO_Port GPIOB
#define limit_EXTI_IRQn EXTI15_10_IRQn
#define PC_USART_TX_Pin GPIO_PIN_8
#define PC_USART_TX_GPIO_Port GPIOD
#define PC_USART_RX_Pin GPIO_PIN_9
#define PC_USART_RX_GPIO_Port GPIOD
#define LM_ENR_Pin GPIO_PIN_3
#define LM_ENR_GPIO_Port GPIOB
#define LM_DIR_Pin GPIO_PIN_4
#define LM_DIR_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
